# MaterialThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..MaterialThickness Property
FabricationPart Class See Also
---
The material thickness of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double MaterialThickness { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaterialThickness As Double
	Get
```

Visual C++
---
```text
public:
property double MaterialThickness {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace